import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# import sklearn 
# from sklearn.model_selection import train_test_split


# тестовые данные - 

# 1 Разделите данные Титаника (train.csv) на тренировочную, валидационную и тестовую часть. 
# С помощью валидационной части подберите гиперпараметры для моделей Random Forest, XGBoost, Logistic Regression и KNN. 
# Получите точность этих моделей на тестовой части.

# 2 С помощью RandomForest выберите 2, 4, 8 самых важных признаков и проверьте точность моделей только на этих признаках.

# 3 Используя координаты скважин из файла wells_info.csv разделите их на кластера с помощью любых 4 методов и отобразите разделение. 
# Параметры подбираются самостоятельно.

# 4 Приведите отобранные в 6.1 задании признаки из файла wells_info_with_prod.csv в двумерное пространство. Выделите цветом добычу с этой скважины.



# 1 -----------------------------------------------------------------------------